Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_rcc.h
/** @defgroup RCC_LL_EC_MCO Peripheral MCO get clock source
  * @{
  */
#define LL_RCC_MCO_CLKSOURCE             RCC_CFGR_MCO /*!< MCO Clock source selection */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO_DIV  MCO prescaler
  * @{
  */
#define LL_RCC_MCO_DIV_1                  0x00000000U                                                    /*!< MCO not divided */
#define LL_RCC_MCO_DIV_2                  RCC_CFGR1_MCOPRE_0                                             /*!< MCO divided by 2 */
#define LL_RCC_MCO_DIV_4                  RCC_CFGR1_MCOPRE_1                                             /*!< MCO divided by 4 */
#define LL_RCC_MCO_DIV_8                  (RCC_CFGR1_MCOPRE_1 | RCC_CFGR1_MCOPRE_0)                      /*!< MCO divided by 8 */
#define LL_RCC_MCO_DIV_16                 RCC_CFGR1_MCOPRE_2                                             /*!< MCO divided by 16 */
#define LL_RCC_MCO_DIV_32                 (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_0)                      /*!< MCO divided by 32 */
#define LL_RCC_MCO_DIV_64                 (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_1)                      /*!< MCO divided by 64 */
#define LL_RCC_MCO_DIV_128                (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_1 | RCC_CFGR1_MCOPRE_0) /*!< MCO divided by 128 */
/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define LL_RCC_PERIPH_FREQUENCY_NO        0x00000000U                 /*!< No clock enabled for the peripheral            */
#define LL_RCC_PERIPH_FREQUENCY_NA        0xFFFFFFFFU                 /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

#if defined(CANFD)
/** @defgroup RCC_LL_EC_CANFD_CLKSOURCE Peripheral CANFD clock source selection
  * @{
  */
#define LL_RCC_CANFD_CLKSOURCE_PLL       0x00000000U                                                           /*!< PLL clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV2  RCC_CFGR2_CANCKSEL_0                                                  /*!< PLL/2 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV3  RCC_CFGR2_CANCKSEL_1                                                  /*!< PLL/3 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV4  (RCC_CFGR2_CANCKSEL_1 | RCC_CFGR2_CANCKSEL_0)                         /*!< PLL/4 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV5  RCC_CFGR2_CANCKSEL_2                                                  /*!< PLL/5 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV6  (RCC_CFGR2_CANCKSEL_2 | RCC_CFGR2_CANCKSEL_0)                         /*!< PLL/6 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV7  (RCC_CFGR2_CANCKSEL_2 | RCC_CFGR2_CANCKSEL_1)                         /*!< PLL/7 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV8  (RCC_CFGR2_CANCKSEL_2 | RCC_CFGR2_CANCKSEL_1 | RCC_CFGR2_CANCKSEL_0)  /*!< PLL/8 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_HSE       RCC_CFGR2_CANCKSEL_3                                                  /*!< HSE clock selected as CANFD clock */
/**
  * @}
  */
#endif /* CANFD */

#if defined(RCC_BDCR_RTCSEL)
/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_RTC_CLKSOURCE_NONE          0x00000000U             /*!< No clock used as RTC clock */
#if defined(RCC_LSE_SUPPORT)
#define LL_RCC_RTC_CLKSOURCE_LSE           RCC_BDCR_RTCSEL_0       /*!< LSE oscillator clock used as RTC clock */
#endif
#define LL_RCC_RTC_CLKSOURCE_LSI           RCC_BDCR_RTCSEL_1       /*!< LSI oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV128    RCC_BDCR_RTCSEL         /*!< HSE oscillator clock divided by 128 used as RTC clock */
/**
  * @}
  */
#endif

/** @defgroup RCC_LL_EC_PVD_Filter_CLKSOURCE  Peripheral PVD Filter clock source selection
  * @{
  */
#define LL_RCC_PVD_FILTERCLK_LSI            0x00000000
#define LL_RCC_PVD_FILTERCLK_LSE            RCC_CFGR1_PVDSEL_0
#define LL_RCC_PVD_FILTERCLK_PCLK           RCC_CFGR1_PVDSEL_1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USB_CLKSOURCE  Peripheral USB clock source selection
  * @{
  */
#define LL_RCC_USB_CLKSOURCE_PLL           0x00000000U            /*!< PLL clock used as USB clock source */
#define LL_RCC_USB_CLKSOURCE_HSI48         RCC_CFGR1_USBSELHSI48  /*!< HSI48 clock used as USB clock source */
/**
  * @}
  */
  
/** @defgroup RCC_LL_EC_USB_Prediv  Peripheral USB clock prescaler
  * @{
  */
#define LL_RCC_USB_DIV_1P5            0x00000000U                              /*!< USB divided by 1.5 */
#define LL_RCC_USB_DIV_1              RCC_CFGR_USBPRE_0                        /*!< USB divided by 1   */
#define LL_RCC_USB_DIV_2P5            RCC_CFGR_USBPRE_1                        /*!< USB divided by 2.5 */
#define LL_RCC_USB_DIV_2              (RCC_CFGR_USBPRE_1 | RCC_CFGR_USBPRE_0)  /*!< USB divided by 2 */
#define LL_RCC_USB_DIV_3              RCC_CFGR_USBPRE_2                        /*!< USB divided by 3 */
#define LL_RCC_USB_DIV_3P5            (RCC_CFGR_USBPRE_2 | RCC_CFGR_USBPRE_0)  /*!< USB divided by 3.5 */
#define LL_RCC_USB_DIV_4              (RCC_CFGR_USBPRE_2 | RCC_CFGR_USBPRE_1)  /*!< USB divided by 4 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ADC_CLKSOURCE  Peripheral ADC clock source selection
  * @{
  */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV2       RCC_CFGR_ADCPRE_DIV2                    /*!< PCLK/2 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV4       RCC_CFGR_ADCPRE_DIV4                    /*!< PCLK/4 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV6       RCC_CFGR_ADCPRE_DIV6                    /*!< PCLK/6 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV8       RCC_CFGR_ADCPRE_DIV8                    /*!< PCLK/8 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV12      RCC_CFGR_ADCPRE_DIV12                   /*!< PCLK/12 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV16      RCC_CFGR_ADCPRE_DIV16                   /*!< PCLK/16 clock selected as ADC clock */
/**
  * @}
  */
/** @defgroup RCC_LL_EC_USART1_CLKSOURCE  Peripheral USART1 clock source selection
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE_PCLK       0x00000000U
#define LL_RCC_USART1_CLKSOURCE_SYSCLK     RCC_CCIPR_USART1SEL_0
#define LL_RCC_USART1_CLKSOURCE_HSI        RCC_CCIPR_USART1SEL_1
#define LL_RCC_USART1_CLKSOURCE_LSE        (RCC_CCIPR_USART1SEL_0 | RCC_CCIPR_USART1SEL_1)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USART2_CLKSOURCE  Peripheral USART2 clock source selection
  * @{
  */
#define LL_RCC_USART2_CLKSOURCE_PCLK       0x00000000U
#define LL_RCC_USART2_CLKSOURCE_SYSCLK     RCC_CCIPR_USART2SEL_0
#define LL_RCC_USART2_CLKSOURCE_HSI        RCC_CCIPR_USART2SEL_1
#define LL_RCC_USART2_CLKSOURCE_LSE        (RCC_CCIPR_USART2SEL_0 | RCC_CCIPR_USART2SEL_1)
/**
  * @}
  */

