Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_rcc.h
/** @defgroup RCC_LL_EC_USART3_CLKSOURCE  Peripheral USART3 clock source selection
  * @{
  */
#define LL_RCC_USART3_CLKSOURCE_PCLK       0x00000000U
#define LL_RCC_USART3_CLKSOURCE_SYSCLK     RCC_CCIPR_USART3SEL_0
#define LL_RCC_USART3_CLKSOURCE_HSI        RCC_CCIPR_USART3SEL_1
#define LL_RCC_USART3_CLKSOURCE_LSE        (RCC_CCIPR_USART3SEL_0 | RCC_CCIPR_USART3SEL_1)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LPUART1_CLKSOURCE  Peripheral LPUART1 clock source selection
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE_PCLK      0x00000000U
#define LL_RCC_LPUART1_CLKSOURCE_SYSCLK    RCC_CCIPR_LPUART1SEL_0
#define LL_RCC_LPUART1_CLKSOURCE_HSI       RCC_CCIPR_LPUART1SEL_1
#define LL_RCC_LPUART1_CLKSOURCE_LSE       (RCC_CCIPR_LPUART1SEL_0 | RCC_CCIPR_LPUART1SEL_1)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LPTIM1_CLKSOURCE  Peripheral LPTIM1 clock source selection
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE_PCLK       0x00000000U
#define LL_RCC_LPTIM1_CLKSOURCE_LSI        RCC_CCIPR_LPTIM1SEL_0
#define LL_RCC_LPTIM1_CLKSOURCE_HSI        RCC_CCIPR_LPTIM1SEL_1
#define LL_RCC_LPTIM1_CLKSOURCE_LSE        RCC_CCIPR_LPTIM1SEL
/**
  * @}
  */

/** @defgroup RCC_LL_EC_COMP1_CLKSOURCE  Peripheral COMP1 clock source selection
  * @{
  */
#define LL_RCC_COMP1_CLKSOURCE_PCLK       0x00000000U
#define LL_RCC_COMP1_CLKSOURCE_LSI        RCC_CCIPR_COMP1SEL_0
#define LL_RCC_COMP1_CLKSOURCE_LSE        RCC_CCIPR_COMP1SEL_1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_COMP2_CLKSOURCE  Peripheral COMP2 clock source selection
  * @{
  */
#define LL_RCC_COMP2_CLKSOURCE_PCLK       0x00000000U
#define LL_RCC_COMP2_CLKSOURCE_LSI        RCC_CCIPR_COMP2SEL_0
#define LL_RCC_COMP2_CLKSOURCE_LSE        RCC_CCIPR_COMP2SEL_1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_COMP3_CLKSOURCE  Peripheral COMP3 clock source selection
  * @{
  */
#define LL_RCC_COMP3_CLKSOURCE_PCLK       0x00000000U
#define LL_RCC_COMP3_CLKSOURCE_LSI        RCC_CCIPR_COMP3SEL_0
#define LL_RCC_COMP3_CLKSOURCE_LSE        RCC_CCIPR_COMP3SEL_1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_COMP4_CLKSOURCE  Peripheral COMP4 clock source selection
  * @{
  */
#define LL_RCC_COMP4_CLKSOURCE_PCLK       0x00000000U
#define LL_RCC_COMP4_CLKSOURCE_LSI        RCC_CCIPR_COMP4SEL_0
#define LL_RCC_COMP4_CLKSOURCE_LSE        RCC_CCIPR_COMP4SEL_1
/**
  * @}
  */

#if defined(RCC_PLL_SUPPORT)
/** @defgroup RCC_LL_EC_PLLSOURCE  PLL entry clock source
  * @{
  */
#define LL_RCC_PLLSOURCE_HSI_DIV2          0x00000000U                  /*!< HSI/2 clock selected as PLL entry clock source */
#define LL_RCC_PLLSOURCE_HSE               RCC_CFGR3_PLLSRC             /*!< HSE clock selected as PLL entry clock source */
/**
  * @}
  */
  
/** @defgroup RCC_LL_EC_HSE_PREDIV_DIV HSE PREDIV Division factor
  * @{
  */
#define LL_RCC_HSE_PREDIV_DIV_1                0x00000000U              /*!< HSE divider clock clock not divided */
#define LL_RCC_HSE_PREDIV_DIV_2                RCC_CFGR3_PLLXTPRE        /*!< HSE divider clock divided by 2 for PLL entry */
/**
  * @}
  */
  
/** @defgroup RCC_LL_EC_PREDIV_DIV PREDIV Division factor
  * @{
  */
#define LL_RCC_PREDIV_DIV_1                RCC_CFGR3_PLLPREDIV1         /*!< PLL postdivider clock not divided */
#define LL_RCC_PREDIV_DIV_2                RCC_CFGR3_PLLPREDIV2         /*!< PLL postdivider clock by 2 */
#define LL_RCC_PREDIV_DIV_4                RCC_CFGR3_PLLPREDIV4         /*!< PLL postdivider clock by 4 */
#define LL_RCC_PREDIV_DIV_8                RCC_CFGR3_PLLPREDIV8         /*!< PLL postdivider clock by 8 */
/**
  * @}
  */
  
/** @defgroup RCC_LL_EC_POSTDIV_DIV POSTDIV Division factor
  * @{
  */
#define LL_RCC_POSTDIV_DIV_1                RCC_CFGR3_PLLPOSTDIV1         /*!< PLL predivider clock not divided */
#define LL_RCC_POSTDIV_DIV_2                RCC_CFGR3_PLLPOSTDIV2         /*!< PLL predivider clock by 2 */
#define LL_RCC_POSTDIV_DIV_4                RCC_CFGR3_PLLPOSTDIV4         /*!< PLL predivider clock by 4 */
#define LL_RCC_POSTDIV_DIV_8                RCC_CFGR3_PLLPOSTDIV8         /*!< PLL predivider clock by 8 */
/**
  * @}
  */
#endif

/** @defgroup RCC_HSE_EC_Freq HSE Config
  * @{
  */
#define LL_RCC_HSE_4_8MHz                 0x00000000U
#define LL_RCC_HSE_8_16MHz                RCC_CFGR2_HSEDRV_0
#define LL_RCC_HSE_16_32MHz               RCC_CFGR2_HSEDRV_1
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Macros RCC Exported Macros
  * @{
  */

/** @defgroup RCC_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in RCC register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_RCC_WriteReg(__REG__, __VALUE__) WRITE_REG((RCC->__REG__), (__VALUE__))

/**
  * @brief  Read a value in RCC register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_RCC_ReadReg(__REG__) READ_REG(RCC->__REG__)
/**
  * @}
  */

/** @defgroup RCC_LL_EM_CALC_FREQ Calculate frequencies
  * @{
  */
#if defined(RCC_PLL_SUPPORT)
/**
  * @brief  Helper macro to calculate the PLLCLK frequency on system domain
  * @param __INPUTFREQ__ PLL input frequency source, which can be:
  *                       - HSE clock predivided by 1 or 2
  *                       - HSI clock predivided by 2
  * @param  __PREDIV__: This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PREDIV_DIV_1
  *         @arg @ref LL_RCC_PREDIV_DIV_2
  *         @arg @ref LL_RCC_PREDIV_DIV_4
  *         @arg @ref LL_RCC_PREDIV_DIV_8
  * @param  __PLLMUL__: This parameter must be a number between Min_Data = 2 and Max_Data = 257
  * @param  __POSTDIV__: This parameter can be one of the following values:
  *         @arg @ref LL_RCC_POSTDIV_DIV_1
  *         @arg @ref LL_RCC_POSTDIV_DIV_2
  *         @arg @ref LL_RCC_POSTDIV_DIV_4
  *         @arg @ref LL_RCC_POSTDIV_DIV_8
  * @retval PLL clock frequency (in Hz)
  */
#define __LL_RCC_CALC_PLLCLK_FREQ(__INPUTFREQ__, __PREDIV__, __PLLMUL__, __POSTDIV__) \
                                 ((((__INPUTFREQ__) >> ((__PREDIV__) >> RCC_CFGR3_PLLPREDIV_Pos)) * (__PLLMUL__)) >> ((__POSTDIV__) >> RCC_CFGR3_PLLPOSTDIV_Pos))
#endif

/**
  * @brief  Helper macro to calculate the HCLK frequency
  * @param  __SYSCLKFREQ__ SYSCLK frequency
  * @param  __AHBPRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SYSCLK_DIV_1
  *         @arg @ref LL_RCC_SYSCLK_DIV_2
  *         @arg @ref LL_RCC_SYSCLK_DIV_4
  *         @arg @ref LL_RCC_SYSCLK_DIV_8
  *         @arg @ref LL_RCC_SYSCLK_DIV_16
  *         @arg @ref LL_RCC_SYSCLK_DIV_64
  *         @arg @ref LL_RCC_SYSCLK_DIV_128
  *         @arg @ref LL_RCC_SYSCLK_DIV_256
  *         @arg @ref LL_RCC_SYSCLK_DIV_512
  * @retval HCLK clock frequency (in Hz)
  */
#define __LL_RCC_CALC_HCLK_FREQ(__SYSCLKFREQ__,__AHBPRESCALER__)  \
  ((__SYSCLKFREQ__) >> (AHBPrescTable[((__AHBPRESCALER__) & RCC_CFGR_HPRE) >>  RCC_CFGR_HPRE_Pos] & 0x1FU))

/**
  * @brief  Helper macro to calculate the PCLK1 frequency (APB1)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB1PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB1_DIV_1
  *         @arg @ref LL_RCC_APB1_DIV_2
  *         @arg @ref LL_RCC_APB1_DIV_4
  *         @arg @ref LL_RCC_APB1_DIV_8
  *         @arg @ref LL_RCC_APB1_DIV_16
  * @retval PCLK1 clock frequency (in Hz)
  */
#define __LL_RCC_CALC_PCLK1_FREQ(__HCLKFREQ__, __APB1PRESCALER__)  \
  ((__HCLKFREQ__) >> (APBPrescTable[(__APB1PRESCALER__) >>  RCC_CFGR_PPRE1_Pos] & 0x1FU))

/**
  * @brief  Helper macro to calculate the PCLK2 frequency (APB2)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB2PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB2_DIV_1
  *         @arg @ref LL_RCC_APB2_DIV_2
  *         @arg @ref LL_RCC_APB2_DIV_4
  *         @arg @ref LL_RCC_APB2_DIV_8
  *         @arg @ref LL_RCC_APB2_DIV_16
  * @retval PCLK2 clock frequency (in Hz)
  */
#define __LL_RCC_CALC_PCLK2_FREQ(__HCLKFREQ__, __APB2PRESCALER__)  \
  ((__HCLKFREQ__) >> (APBPrescTable[(__APB2PRESCALER__) >>  RCC_CFGR_PPRE2_Pos] & 0x1FU))

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Functions RCC Exported Functions
  * @{
  */

