Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_rcc.h
/**
  * @brief  Get USART2 clock source
  * @rmtoll CCIPR        USART2SEL        LL_RCC_GetUSART2ClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_USART2SEL));
}

/**
  * @brief  Set USART3 clock source
  * @rmtoll CCIPR        USART3SEL      LL_RCC_SetUSART3ClockSource
  * @param  USART3Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_LSE
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART3ClockSource(uint32_t USART3Source)
{
  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_USART3SEL, USART3Source);
}

/**
  * @brief  Get USART3 clock source
  * @rmtoll CCIPR        USART3SEL        LL_RCC_GetUSART3ClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART3ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_USART3SEL));
}

/**
  * @brief  Set LPUART1 clock source
  * @rmtoll CCIPR        LPUART1SEL      LL_RCC_SetLPUART1ClockSource
  * @param  LPUART1Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSE
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPUART1ClockSource(uint32_t LPUART1Source)
{
  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_LPUART1SEL, LPUART1Source);
}

/**
  * @brief  Get LPUART1 clock source
  * @rmtoll CCIPR        LPUART1SEL        LL_RCC_GetLPUART1ClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPUART1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_LPUART1SEL));
}

/**
  * @brief  Set LPTIM1 clock source
  * @rmtoll CCIPR        LPTIM1SEL      LL_RCC_SetLPTIM1ClockSource
  * @param  LPTIM1Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM1ClockSource(uint32_t LPTIM1Source)
{
  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_LPTIM1SEL, LPTIM1Source);
}

/**
  * @brief  Get LPTIM1 clock source
  * @rmtoll CCIPR        LPTIM1SEL        LL_RCC_GetLPTIM1ClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_LPTIM1SEL));
}

/**
  * @brief  Set COMP1 clock source
  * @rmtoll CCIPR        COMP1SEL      LL_RCC_SetCOMP1ClockSource
  * @param  COMP1Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_LSE
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCOMP1ClockSource(uint32_t COMP1Source)
{
  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_COMP1SEL, COMP1Source);
}

/**
  * @brief  Get COMP1 clock source
  * @rmtoll CCIPR        COMP1SEL        LL_RCC_GetCOMP1ClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCOMP1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_COMP1SEL));
}

/**
  * @brief  Set COMP2 clock source
  * @rmtoll CCIPR        COMP2SEL      LL_RCC_SetCOMP2ClockSource
  * @param  COMP2Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_LSE
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCOMP2ClockSource(uint32_t COMP2Source)
{
  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_COMP2SEL, COMP2Source);
}

/**
  * @brief  Get COMP2 clock source
  * @rmtoll CCIPR        COMP2SEL        LL_RCC_GetCOMP2ClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCOMP2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_COMP2SEL));
}

/**
  * @brief  Set COMP3 clock source
  * @rmtoll CCIPR        COMP3SEL      LL_RCC_SetCOMP3ClockSource
  * @param  COMP3Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_COMP3_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_COMP3_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_COMP3_CLKSOURCE_LSE
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCOMP3ClockSource(uint32_t COMP3Source)
{
  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_COMP3SEL, COMP3Source);
}

/**
  * @brief  Get COMP3 clock source
  * @rmtoll CCIPR        COMP3SEL        LL_RCC_GetCOMP3ClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_COMP3_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_COMP3_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_COMP3_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCOMP3ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_COMP3SEL));
}

/**
  * @brief  Set COMP4 clock source
  * @rmtoll CCIPR        COMP4SEL      LL_RCC_SetCOMP4ClockSource
  * @param  COMP4Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_COMP4_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_COMP4_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_COMP4_CLKSOURCE_LSE
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCOMP4ClockSource(uint32_t COMP4Source)
{
  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_COMP4SEL, COMP4Source);
}

/**
  * @brief  Get COMP4 clock source
  * @rmtoll CCIPR        COMP4SEL        LL_RCC_GetCOMP4ClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_COMP4_CLKSOURCE_PCLK
  *         @arg @ref LL_RCC_COMP4_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_COMP4_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCOMP4ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_COMP4SEL));
}
/**
  * @}
  */
#if defined(RTC)
#if defined(RCC_BDCR_RTCSEL)
/** @defgroup RCC_LL_EF_RTC RTC
  * @{
  */

/**
  * @brief  Set RTC Clock Source
  * @note Once the RTC clock source has been selected, it cannot be changed anymore unless
  *       the Backup domain is reset, or unless a failure is detected on LSE (LSECSSD is
  *       set). The BDRST bit can be used to reset them.
  * @rmtoll BDCR         RTCSEL        LL_RCC_SetRTCClockSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV128
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRTCClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->BDCR, RCC_BDCR_RTCSEL, Source);
}

/**
  * @brief  Get RTC Clock Source
  * @rmtoll BDCR         RTCSEL        LL_RCC_GetRTCClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV128
  */
__STATIC_INLINE uint32_t LL_RCC_GetRTCClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL));
}
#endif
/**
  * @brief  Enable RTC
  * @rmtoll BDCR         RTCEN         LL_RCC_EnableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableRTC(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Disable RTC
  * @rmtoll BDCR         RTCEN         LL_RCC_DisableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableRTC(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Check if RTC has been enabled or not
  * @rmtoll BDCR         RTCEN         LL_RCC_IsEnabledRTC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledRTC(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_RTCEN) == (RCC_BDCR_RTCEN)) ? 1UL : 0UL);
}

/**
  * @brief  Force the Backup domain reset
  * @rmtoll BDCR         BDRST         LL_RCC_ForceBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ForceBackupDomainReset(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @brief  Release the Backup domain reset
  * @rmtoll BDCR         BDRST         LL_RCC_ReleaseBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ReleaseBackupDomainReset(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @}
  */
#endif

#if defined(RCC_PLL_SUPPORT)
/** @defgroup RCC_LL_EF_PLL PLL
  * @{
  */

/**
  * @brief  Enable PLL
  * @rmtoll CR           PLLON         LL_RCC_PLL_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_PLLON);
}

/**
  * @brief  Disable PLL
  * @note Cannot be disabled if the PLL clock is used as the system clock
  * @rmtoll CR           PLLON         LL_RCC_PLL_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_PLLON);
}

/**
  * @brief  Check if PLL Ready
  * @rmtoll CR           PLLRDY        LL_RCC_PLL_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_PLLRDY) == (RCC_CR_PLLRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Configure PLL used for SYSCLK Domain
  * @rmtoll CFGR         PLLSRC        LL_RCC_PLL_ConfigDomain_SYS\n
  *         CFGR         PLLXTPRE      LL_RCC_PLL_ConfigDomain_SYS\n
  *         CFGR         PLLMULL       LL_RCC_PLL_ConfigDomain_SYS\n
  * @param  PLLSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI_DIV2
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  * @param  PLLPrediv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PREDIV_DIV_1
  *         @arg @ref LL_RCC_PREDIV_DIV_2
  *         @arg @ref LL_RCC_PREDIV_DIV_4
  *         @arg @ref LL_RCC_PREDIV_DIV_8
  * @param  PLLMul This parameter must be a number between Min_Data = 2 and Max_Data = 257
  * @param  PLLPostdiv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_POSTDIV_DIV_1
  *         @arg @ref LL_RCC_POSTDIV_DIV_2
  *         @arg @ref LL_RCC_POSTDIV_DIV_4
  *         @arg @ref LL_RCC_POSTDIV_DIV_8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_ConfigDomain_SYS(uint32_t PLLSource, uint32_t PLLPrediv, uint32_t PLLMul, uint32_t PLLPostdiv)
{
  MODIFY_REG(RCC->CFGR3, RCC_CFGR3_PLLSRC | RCC_CFGR3_PLLXTPRE | RCC_CFGR3_PLLPREDIV | RCC_CFGR3_PLLPOSTDIV |
                         RCC_CFGR3_PLLFBDIV, PLLSource | PLLPrediv | ((PLLMul -2U) << RCC_CFGR3_PLLFBDIV_Pos) | PLLPostdiv);
}

/**
  * @brief  Configure PLL clock source
  * @rmtoll CFGR      PLLSRC        LL_RCC_PLL_SetMainSource
  * @param PLLSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI_DIV2
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetMainSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->CFGR3, RCC_CFGR3_PLLSRC , PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL clock source.
  * @rmtoll CFGR      PLLSRC        LL_RCC_PLL_GetMainSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI_DIV2
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetMainSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR3, RCC_CFGR3_PLLSRC));
}

/**
  * @brief  Configure PLL Multiplication Factor.
  * @param This parameter must be a number between Min_Data = 2 and Max_Data = 257
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetMulFactor(uint32_t PLLMul)
{
  MODIFY_REG(RCC->CFGR3, RCC_CFGR3_PLLFBDIV, ((PLLMul - 2U) << RCC_CFGR3_PLLFBDIV_Pos));
}

/**
  * @brief  Get the PLL Multiplication Factor.
  * @retval Returned value is a number between Min_Data = 2 and Max_Data = 257
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetMulFactor(void)
{
  return (uint32_t)((READ_BIT(RCC->CFGR3, RCC_CFGR3_PLLFBDIV) >> RCC_CFGR3_PLLFBDIV_Pos) + 2U);
}

/**
  * @brief  Set HSE PREDIV division factor for the main PLL
  * @note They can be written only when the PLL is disabled
  * @rmtoll CFGR3        PLLXTPRE      LL_RCC_PLL_SetHSEPrediv
  * @param HSEPrediv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HSE_PREDIV_DIV_1
  *         @arg @ref LL_RCC_HSE_PREDIV_DIV_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetHSEPrediv(uint32_t HSEPrediv)
{
  MODIFY_REG(RCC->CFGR3, RCC_CFGR3_PLLXTPRE, HSEPrediv);
}

/**
  * @brief  Get HSE PREDIV division factor for the main PLL
  * @note They can be written only when the PLL is disabled
  * @rmtoll CFGR3        PLLXTPRE      LL_RCC_PLL_GetHSEPrediv
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_HSE_PREDIV_DIV_1
  *         @arg @ref LL_RCC_HSE_PREDIV_DIV_2
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetHSEPrediv(void)
{
  return (uint32_t)READ_BIT(RCC->CFGR3, RCC_CFGR3_PLLXTPRE);
}

/**
  * @brief  Set PREDIV division factor for the main PLL
  * @note They can be written only when the PLL is disabled
  * @rmtoll CFGR3        PLLPREDIV      LL_RCC_PLL_SetPrediv
  * @param Prediv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PREDIV_DIV_1
  *         @arg @ref LL_RCC_PREDIV_DIV_2
  *         @arg @ref LL_RCC_PREDIV_DIV_4
  *         @arg @ref LL_RCC_PREDIV_DIV_8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetPrediv(uint32_t Prediv)
{
  MODIFY_REG(RCC->CFGR3, RCC_CFGR3_PLLPREDIV, Prediv);
}

/**
  * @brief  Get PREDIV division factor for the main PLL
  * @note They can be written only when the PLL is disabled
  * @rmtoll CFGR3        PLLPREDIV      LL_RCC_PLL_GetPrediv
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PREDIV_DIV_1
  *         @arg @ref LL_RCC_PREDIV_DIV_2
  *         @arg @ref LL_RCC_PREDIV_DIV_4
  *         @arg @ref LL_RCC_PREDIV_DIV_8
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetPrediv(void)
{
  return (uint32_t)READ_BIT(RCC->CFGR3, RCC_CFGR3_PLLPREDIV);
}

/**
  * @brief  Set POSTDIV division factor for the main PLL
  * @note They can be written only when the PLL is disabled
  * @rmtoll CFGR3        PLLPOSTDIV      LL_RCC_PLL_SetPostdiv
  * @param Postdiv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_POSTDIV_DIV_1
  *         @arg @ref LL_RCC_POSTDIV_DIV_2
  *         @arg @ref LL_RCC_POSTDIV_DIV_4
  *         @arg @ref LL_RCC_POSTDIV_DIV_8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetPostdiv(uint32_t Postdiv)
{
  MODIFY_REG(RCC->CFGR3, RCC_CFGR3_PLLPOSTDIV, Postdiv);
}

/**
  * @brief  Get POSTDIV division factor for the main PLL
  * @note They can be written only when the PLL is disabled
  * @rmtoll CFGR3        PLLPOSTDIV      LL_RCC_PLL_GetPostdiv
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_POSTDIV_DIV_1
  *         @arg @ref LL_RCC_POSTDIV_DIV_2
  *         @arg @ref LL_RCC_POSTDIV_DIV_4
  *         @arg @ref LL_RCC_POSTDIV_DIV_8
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetPostdiv(void)
{
  return (uint32_t)READ_BIT(RCC->CFGR3, RCC_CFGR3_PLLPOSTDIV);
}
/**
  * @}
  */
#endif


